{
  "storyId": "thai-advanced-1-a-family-reunion",
  "bookId": "thai-advanced-1",
  "language": "th",
  "title": {
    "source": "การรวมตัวของครอบครัว",
    "target": "A Family Reunion"
  },
  "sentences": [
    {
      "source": "การรวมตัวของครอบครัวประจำปีที่ฟาร์มของคุณยายโรซ่าเป็นประเพณีที่โซเฟียหวงแหนอย่างลึกซึ้ง",
      "target": "The annual family reunion at Grandma Rosa's farm was a tradition Sofia cherished deeply.",
      "phonetic": "gaan ruam-dtua khɔ̌ɔng khrɔɔp-khrua bprà-jam-bpii thîi faam khɔ̌ɔng khun-yaai roo-sâa bpen bprà-phee-nii thîi soo-fii-aa hǔang-hɛ̌ɛn yàang lʉ́k-sʉ́ng",
      "breakdown": []
    },
    {
      "source": "ญาติจากทั่วประเทศมารวมตัวกัน เติมเต็มอากาศด้วยเสียงหัวเราะและเรื่องราว",
      "target": "Relatives from across the country gathered, filling the air with laughter and stories.",
      "phonetic": "yâat jàak thûa bprà-thêet maa ruam-dtua-gan dtə̀əm-dtèm aa-gàat dûai sǐang-hǔa-ró láe rʉ̂ang-raao",
      "breakdown": []
    },
    {
      "source": "ฟาร์ม ด้วยทุ่งนากว้างใหญ่และยุ้งฉางเก่า รู้สึกเหมือนแคปซูลเวลา",
      "target": "The farm, with its sprawling fields and old barn, felt like a time capsule.",
      "phonetic": "faam dûai thûng-naa gwâang-yài láe yúng-chaang gào rúu-sʉ̀k mʉ̌an khɛ̀ɛp-suun wee-laa",
      "breakdown": []
    },
    {
      "source": "โซเฟียช่วยลูกพี่ลูกน้องของเธอเตรียมงานเลี้ยง สับผักและคนซอส",
      "target": "Sofia helped her cousins prepare a feast, chopping vegetables and stirring sauces.",
      "phonetic": "soo-fii-aa chûai lûuk-phîi-lûuk-nɔ́ɔng khɔ̌ɔng thəə dtrìiam ngaan-líiang sàp phàk láe khon sɔ́ɔt",
      "breakdown": []
    },
    {
      "source": "คุณยายโรซ่าแบ่งปันสูตรอาหารที่ส่งต่อมาหลายรุ่น แต่ละสูตรมีเรื่องราว",
      "target": "Grandma Rosa shared recipes passed down through generations, each with a story.",
      "phonetic": "khun-yaai roo-sâa bɛ̀ng-bpan sùut-aa-hǎan thîi sɔ̀ng-dtɔ̀ɔ maa lǎai rûn dtɛ̀ɛ-lá-sùut mii rʉ̂ang-raao",
      "breakdown": []
    },
    {
      "source": "ครอบครัวนั่งรอบโต๊ะยาว แบ่งปันความทรงจำของการรวมตัวในอดีต",
      "target": "The family sat around a long table, sharing memories of past reunions.",
      "phonetic": "khrɔɔp-khrua nâng rɔ̂ɔp dtó yaao bɛ̀ng-bpan khwaam-song-jam khɔ̌ɔng gaan ruam-dtua nai à-dìit",
      "breakdown": []
    },
    {
      "source": "ลุงของโซเฟียเล่าการผจญภัยในวัยเด็กของเขาที่ฟาร์ม ทำให้ทุกคนหัวเราะ",
      "target": "Sofia's uncle recounted his childhood adventures on the farm, making everyone laugh.",
      "phonetic": "lung khɔ̌ɔng soo-fii-aa lâo gaan phà-jon-phai nai wai-dèk khɔ̌ɔng kháo thîi faam tham hâi thúk-khon hǔa-ró",
      "breakdown": []
    },
    {
      "source": "ลูกพี่ลูกน้องที่อายุน้อยกว่าของเธอวิ่งผ่านทุ่งนา เล่นเกมจนพลบค่ำ",
      "target": "Her younger cousins ran through the fields, playing games until sunset.",
      "phonetic": "lûuk-phîi-lûuk-nɔ́ɔng thîi aa-yú-nɔ́ɔi-gwàa khɔ̌ɔng thəə wîng phàan thûng-naa lên geem jon phlóp-khâm",
      "breakdown": []
    },
    {
      "source": "โซเฟียรู้สึกถึงความคิดถึงอดีต จดจำวัยเด็กของเธอเองที่นี่",
      "target": "Sofia felt a pang of nostalgia, remembering her own childhood here.",
      "phonetic": "soo-fii-aa rúu-sʉ̀k thʉ̌ng khwaam-khít-thʉ̌ng à-dìit jòt-jam wai-dèk khɔ̌ɔng thəə eeng thîi-nîi",
      "breakdown": []
    },
    {
      "source": "หลังอาหารเย็น พวกเขาจุดกองไฟ ปิ้งมาร์ชแมลโลว์ใต้แสงดาว",
      "target": "After dinner, they lit a bonfire, roasting marshmallows under the stars.",
      "phonetic": "lǎng aa-hǎan-yen phûak-kháo jùt gɔɔng-fai bpîng maa-chɛɛ-loh dtâi sɛ̌ɛng-daao",
      "breakdown": []
    },
    {
      "source": "คุณยายโรซ่าเล่าเรื่องราวในวัยหนุ่มสาวของเธอ เสียงของเธออ่อนโยนแต่น่าหลงใหล",
      "target": "Grandma Rosa told tales of her youth, her voice soft but captivating.",
      "phonetic": "khun-yaai roo-sâa lâo rʉ̂ang-raao nai wai-nùm-sǎao khɔ̌ɔng thəə sǐang khɔ̌ɔng thəə ɔ̀ɔn-yoon dtɛ̀ɛ nâa-lǒng-lǎi",
      "breakdown": []
    },
    {
      "source": "โซเฟียบันทึกเรื่องราว ต้องการรักษาไว้สำหรับอนาคต",
      "target": "Sofia recorded the stories, wanting to preserve them for the future.",
      "phonetic": "soo-fii-aa ban-thʉ́k rʉ̂ang-raao dtɔ̂ng-gaan rák-sǎa wái sǎm-ràp à-naa-khót",
      "breakdown": []
    },
    {
      "source": "ครอบครัวร้องเพลงแบบดั้งเดิม เสียงของพวกเขาผสมผสานกันอย่างกลมกลืน",
      "target": "The family sang traditional songs, their voices blending in harmony.",
      "phonetic": "khrɔɔp-khrua rɔ́ɔng-phleeng bɛ̀ɛp dtâng-də̀əm sǐang khɔ̌ɔng phûak-kháo phà-sǒm-phà-sǎan gan yàang glom-glʉʉn",
      "breakdown": []
    },
    {
      "source": "น้องชายของโซเฟีย ช่างภาพ จับภาพช่วงเวลาแห่งความสุขอย่างตรงไปตรงมา",
      "target": "Sofia's brother, a photographer, captured candid moments of joy.",
      "phonetic": "nɔ́ɔng-chaai khɔ̌ɔng soo-fii-aa châang-phâap jàp phâap chûang-wee-laa hɛ̀ɛng khwaam-sùk yàang dtrong-bpai-dtrong-maa",
      "breakdown": []
    },
    {
      "source": "เธอตระหนักว่าการรวมตัวเหล่านี้หายากเพียงใด เมื่อทุกคนยุ่งมาก",
      "target": "She realized how rare these gatherings were, with everyone so busy.",
      "phonetic": "thəə dtrà-nák wâa gaan ruam-dtua lào-níi hǎai-hàak phiang-dài mʉ̂a thúk-khon yûng mâak",
      "breakdown": []
    },
    {
      "source": "การรวมตัวเตือนเธอถึงความสำคัญของการเชื่อมโยง",
      "target": "The reunion reminded her of the importance of connection.",
      "phonetic": "gaan ruam-dtua dtʉan thəə thʉ̌ng khwaam-sǎm-khan khɔ̌ɔng gaan chʉ̂am-yoong",
      "breakdown": []
    },
    {
      "source": "เมื่อคืนสิ้นสุดลง พวกเขาวางแผนงานปีหน้า",
      "target": "As the night ended, they planned next year's event.",
      "phonetic": "mʉ̂a khʉʉn sîn-sùt phûak-kháo waang-phɛ̌ɛn ngaan bpii-nâa",
      "breakdown": []
    },
    {
      "source": "โซเฟียกอดคุณยายของเธอ ขอบคุณสำหรับภูมิปัญญาของเธอ",
      "target": "Sofia hugged her grandmother, grateful for her wisdom.",
      "phonetic": "soo-fii-aa gɔ̀ɔt khun-yaai khɔ̌ɔng thəə khɔ̀ɔp-khun sǎm-ràp phuum-bpan-yaa khɔ̌ɔng thəə",
      "breakdown": []
    },
    {
      "source": "ฟาร์มจะเป็นหัวใจของครอบครัวของพวกเขาเสมอ",
      "target": "The farm would always be their family's heart.",
      "phonetic": "faam jà bpen hǔa-jai khɔ̌ɔng khrɔɔp-khrua khɔ̌ɔng phûak-kháo sà-mə̌ə",
      "breakdown": []
    },
    {
      "source": "เธอออกไปด้วยความรู้สึกของการเป็นส่วนหนึ่งที่ฟื้นคืนมา ถือความรักของครอบครัวของเธอ",
      "target": "She left with a renewed sense of belonging, carrying the love of her family.",
      "phonetic": "thəə ɔ̀ɔk-bpai dûai khwaam-rúu-sʉ̀k khɔ̌ɔng gaan bpen sùan-nʉ̀ng thîi fʉ́ʉn-khʉʉn-maa thʉ̌ʉ khwaam-rák khɔ̌ɔng khrɔɔp-khrua khɔ̌ɔng thəə",
      "breakdown": []
    }
  ],
  "createdAt": "2025-09-30T20:31:00Z",
  "updatedAt": "2025-09-30T20:31:00Z",
  "difficulty": "advanced",
  "summary": "การรวมตัวของครอบครัวที่ฟาร์มและความสำคัญของประเพณีและความผูกพัน"
}
